import React, { useState } from "react";
import "./MorePage.scss";

import imageGermany from "../ImgPage/germany in winter.png";
import imageSpain from "../ImgPage/spain in winter.png";
import imageJapan from "../ImgPage/japan in winter.png";
import imageUkraine from "../ImgPage/ukraine in winter.png";
import imageKorea from "../ImgPage/korea in winter.png";

import dishes from "../ImgPage/dishes.img.png"
import dishesSpain from "../ImgPage/dishesSpain.png"
import dishesKorea from "../ImgPage/dishesKorea.png"
import dishesUkraine from "../ImgPage/dishesUkraine.png"
import dishesJapan from "../ImgPage/dishesJapan.png"

import songs from "../ImgPage/Songs.img.png"
import songsSpain from "../ImgPage/SongsSpain.png"
import songsKorea from "../ImgPage/SongsKorea.png"
import songsUkraine from "../ImgPage/SongsUkraine.png"
import songsJapan from "../ImgPage/SongsJapan.png"


const MorePage = () => {
    const [expandedCardIndex, setExpandedCardIndex] = useState(null);

    const cards = [
        {
            title: "Німеччина",
            shortText: "Новий рік у Німеччині називають 'Сільвестр' (Silvester), оскільки це також день пам’яті святого Сильвестра, одного з перших пап римських. Святкування починається ввечері 31 грудня й триває до ранку 1 січня. Німці надають великого значення цій події, сприймаючи її як...",
            fullText:
                "Новий рік у Німеччині називають 'Сільвестр' (Silvester), оскільки це також день пам’яті святого Сильвестра, одного з перших пап римських. Святкування починається ввечері 31 грудня й триває до ранку 1 січня. Німці надають великого значення цій події, сприймаючи її як шанс попрощатися зі старим роком і привітати новий з позитивними думками. Міста прикрашаються святковими вогнями, а на вулицях відчувається атмосфера загального піднесення та радості.",
            image: imageGermany,
            addFullText: "Новий рік у Німеччині святкують у різний спосіб. Дехто проводить вечір удома в колі сім’ї або друзів, а інші відвідують ресторани, клуби чи великі публічні заходи. Особливою популярністю користуються феєрверки. Наприклад, у Берліні біля Бранденбурзьких воріт збираються сотні тисяч людей, щоб насолодитися масштабним шоу, музичними концертами та привітаннями на великому екрані. Після опівночі люди часто продовжують веселощі, танці та святкування.",
            relatedCards: [
                { image: dishes , title: "Страви", text: "До новорічного столу в Німеччині подають свинячі ковбаски, тушковану капусту, картопляний салат і квашену капусту. Також популярні пончики із солодкою начинкою, які символізують щастя й достаток. " },
                { title: "Традиції", text: "Німці вірять, що перші хвилини нового року визначають, яким буде весь рік. Тому вони створюють галас, щоб відлякати злі сили, використовуючи петарди та феєрверки. Ще одна традиція – ворожіння на свинець (Bleigießen). Плавлений свинець капають у холодну воду, і форма застиглого металу символізує майбутні події. Люди також дарують один одному 'щасливі талісмани' – фігурки свинки, конюшини або димоходника." },
                { image: songs, title: "Пісні", text: "Під час святкування звучать як міжнародні хіти, наприклад, 'Auld Lang Syne', так і традиційні німецькі пісні. Популярні мелодії на тему щастя, дружби й нових починань створюють теплу атмосферу." },
            ],
        },
        {
            title: "Іспанія",
            shortText: "Новий рік в Іспанії, або 'Nochevieja' ('Стара ніч'), є однією з найяскравіших подій року. Святкування починається ввечері 31 грудня і триває до ранку 1 січня. Іспанці зазвичай зустрічають Новий рік у колі родини або друзів, з багатим столом і веселою атмосферою. Важл...",
            fullText:
                "Новий рік в Іспанії, або 'Nochevieja' ('Стара ніч'), є однією з найяскравіших подій року. Святкування починається ввечері 31 грудня і триває до ранку 1 січня. Іспанці зазвичай зустрічають Новий рік у колі родини або друзів, з багатим столом і веселою атмосферою. Важливу роль у святкуванні відіграють спільні традиції, такі як їжа, ворожіння і масові гуляння на площах. Кульмінацією вечора стають 12 ударів годинника, які символізують перехід у новий рік.",
            image: imageSpain,
            addFullText:"Святкування Нового року в Іспанії може відбуватися як вдома, так і на масових заходах. Вдома іспанці готують пишну вечерю, яка супроводжується тостами, спогадами про минулий рік та планами на майбутнє. Багато людей виходять на центральні площі міст, щоб взяти участь у спільних урочистостях. Найвідоміше святкування проходить у Мадриді на площі Пуерта-дель-Соль, де тисячі людей слухають удари дзвону годинника, які транслюються по всій країні.",
            relatedCards: [
                { image: dishesSpain , title: "Страви", text: "До святкового столу в Іспанії подають тапаси, морепродукти, хамон, запеченого ягня або морського окуня. На десерт подають туррон та марципани. Також традиційно п’ють шампанське чи каву." },
                { title: "Традиції", text: "Іспанці під удари годинника о півночі з’їдають 12 виноградин – по одній на кожен місяць року. Якщо встигнути з’їсти всі 12, рік буде вдалим. Для удачі і любові багато хто одягає червону білизну, яку обов’язково має подарувати інша людина. Кільце в келиху шампанського символізує процвітання та фінансову стабільність у новому році. У деяких регіонах прийнято позбавлятися від старих речей, щоб звільнити місце для нового." },
                { image:  songsSpain, title: "Пісні", text: "На новорічних вечірках іспанці слухають популярну танцювальну музику, а також традиційні пісні, що створюють радісний настрій.Одним із улюблених є святковий гімн 'Un Año Más' ('Ще один рік') гурту Mecano." },
            ],
        },
        {
            title: "Японія",
            shortText: "Новий рік в Японії, або Сьоґацу (正月), є одним із найважливіших свят у країні. Він відзначається з 31 грудня до 3 січня, і цей період вважається часом для сімейного відпочинку, духовного очищення та початку нового циклу. У японців сильні асоціації Нового року із чистотою, гармонією та...",
            fullText:
                "Новий рік в Японії, або Сьоґацу (正月), є одним із найважливіших свят у країні. Він відзначається з 31 грудня до 3 січня, і цей період вважається часом для сімейного відпочинку, духовного очищення та початку нового циклу. У японців сильні асоціації Нового року із чистотою, гармонією та молитвами за добробут. Більшість компаній та закладів закриваються, а люди проводять час із родиною, відвідуючи храми чи святкові заходи.",
            image: imageJapan,
            addFullText:"31 грудня японці проводять час у сімейному колі, готуючи оселю й завершуючи справи року. Увечері багато хто відвідує буддійські храми, де дзвони б’ють 108 разів, символізуючи очищення від людських гріхів. 1 січня вважається днем, коли прийнято бажати одне одному щастя. Люди пишуть новорічні листівки (年賀状 – 'ненґаджьо') та дарують подарунки. Часто відвідують синтоїстські храми для молитви на удачу, що називається 'хатсумоде' (перший візит у новому році).",
            relatedCards: [
                { image: dishesJapan , title: "Страви", text: "Основною новорічною стравою є осечі-рьорі — набір різноманітних символічних страв, упакованих у спеціальні коробки. Також популярні рисові тістечка моті та суп озоні, приготовлений із рисових кульок." },
                { title: "Традиції", text: "Перед Новим роком японці проводять генеральне прибирання в домівках, офісах та громадських місцях, щоб очистити простір від усього старого. На двері вішають мотузку з рисової соломи, яка символізує захист від злих духів. У домівках встановлюють прикраси кадомацу(з бамбука, сосни та сливових гілок) і каґамі-моті — дві рисові кульки з мандарином зверху. Також популярна традиція писати побажання на дерев'яних табличках ема і тягнути передбачення на рік." },
                { image: songsJapan ,  title: "Пісні", text: "У Японії не існує традиції новорічних пісень, як у західних країнах. Проте популярними є народні мелодії та сучасні хіти, що транслюються на спеціальних новорічних шоу, наприклад, «Кохаку Ута Гассен»." },
            ],
        },
        {
            title: "Україна",
            shortText: "Новий рік в Україні є одним із найулюбленіших свят, яке відзначають із великим розмахом. Це світське свято, яке має багато сімейних традицій і символізує новий початок. Його святкують в ніч із 31 грудня на 1 січня, хоча підготовка до нього починається задовго до цієї дати. Українці пр...",
            fullText:
                "Новий рік в Україні є одним із найулюбленіших свят, яке відзначають із великим розмахом. Це світське свято, яке має багато сімейних традицій і символізує новий початок. Його святкують в ніч із 31 грудня на 1 січня, хоча підготовка до нього починається задовго до цієї дати. Українці прикрашають оселі ялинками, гірляндами та святковими вогниками. Святкування супроводжується щедрими застіллями, феєрверками(до військового стану), подарунками та розвагами.",
            image: imageUkraine,
            addFullText:"Святкування починається ввечері 31 грудня з підготовки святкового столу та прикрашання оселі. О 12-й ночі сім'ї збираються, щоб під дзвін курантів підняти келихи шампанського та загадати бажання. У багатьох містах влаштовуються концерти, ярмарки та феєрверки. Після півночі люди часто відвідують друзів чи продовжують святкувати на вулиці. Особливої атмосфери додає зимова казкова природа та загальна радість.",
            relatedCards: [
                {image:  dishesUkraine, title: "Страви", text: "На святковому столі обов'язкові традиційні страви: салат «Олів’є», оселедець під шубою, холодець, кутя, мандарини, а також шампанське. Кожна господиня додає щось своє, аби зробити вечерю особливою." },
                { title: "Традиції", text: "Напередодні свята прикрашають ялинку та готують святкові страви. Однією з традицій є загадування бажань під бій курантів, часто супроводжуване написанням бажання на папері, який спалюють і запивають шампанським. Популярна традиція дарувати подарунки. Люди збираються на головних площах міст, де проводять концерти та масові гуляння. Також зранку 1 січня діти можуть отримати солодощі чи подарунки під ялинкою." },
                { image:  songsUkraine,title: "Пісні", text: "В Україні на Новий рік популярні сучасні новорічні пісні, а також традиційні щедрівки, які виконуються вже в період старого Нового року. Однією з найвідоміших є «Щедрик», відомий у світі як «Carol of the Bells»." },
            ],
        },
        {
            title: "Корея",
            shortText: "У Південній Кореї Новий рік святкують двічі: за григоріанським календарем (Сінчхон) 1 січня та за місячним календарем (Соллаль), що зазвичай припадає на кінець січня або початок лютого. Соллаль є головним святом, яке символізує новий початок, шану предкам і сімейні зв’язки. У це... ",
            fullText:
                "У Південній Кореї Новий рік святкують двічі: за григоріанським календарем (Сінчхон) 1 січня та за місячним календарем (Соллаль), що зазвичай припадає на кінець січня або початок лютого. Соллаль є головним святом, яке символізує новий початок, шану предкам і сімейні зв’язки. У цей час корейці проводять час із родиною, виконують традиційні обряди та загадують бажання. Святкування наповнене атмосферою гармонії та оновлення.",
            image: imageKorea,
            addFullText:"На Сінчхон люди обмінюються привітаннями, насолоджуються феєрверками та часто відвідують гори або пляжі, щоб зустріти перший схід сонця. Під час Соллаль родини збираються вдома для обряду чеса (вшанування предків), виконують уклони старшим (себе) та отримують благословення. Популярними є ігри, такі як ютнорі, та частування святковими стравами.",
            relatedCards: [
                { image:  dishesKorea,title: "Страви", text: "Традиційною стравою на Соллаль є суп із рисовими тістечками ттоккук, який символізує новий рік і довголіття. Також подають різноманітні закуски (панчан), печені коржі (чон) і мариновані овочі (кімчі)." },
                { title: "Традиції", text: "Традиції включають уклони старшим,  бажаючи здоров'я та процвітання, за що отримують грошові подарунки, та обряд чеса, під час якого на вівтар кладуть їжу для предків. Родини вдягають традиційний одяг (ханбок) та проводять час у спільних іграх, наприклад, у ютнорі — настільна гра із киданням паличок. Люди вирушають в гори або на узбережжя, щоб побачити перший схід сонця в новому році, що символізує нові надії на майбутній рік. " },
                {image:  songsKorea, title: "Пісні", text: "На Новий рік в Кореї традиційні пісні виконують під час обрядів і святкових зібрань. Під час святкувань часто звучить народна пісня Ариран. Сучасні новорічні концерти часто включають виступи K-pop виконавців." },
            ],
        },
    ];

    const handleExpand = (index) => {
        setExpandedCardIndex(index);
    };

    const handleCollapse = () => {
        setExpandedCardIndex(null);
    };

    return (
        <div className="more-page" id="countries">
            {expandedCardIndex === null ? (
                <div className="card-container">
                    {cards.map((card, index) => (
                        <div className="card" key={index}>
                            <p className="card-title">{card.title}</p>
                            <p className="card-short-text">
                                {card.shortText}
                                <a onClick={() => handleExpand(index)}>
                                    Читати більше
                                </a>
                            </p>
                        </div>
                    ))}
                </div>
            ) : (
                <div className="expanded-content">

                    <div className="top-content">

                        <div className="text-left">
                            <h1>Про святo</h1>
                            <p>{cards[expandedCardIndex].fullText}</p>
                        </div>
                        <img
                            src={cards[expandedCardIndex].image}
                            alt={`Зображення ${cards[expandedCardIndex].title}`}
                            className="image-right"
                        />
                    </div>
                    <div className="bottom-content">
                        <div className="bottom-text">
                            <h2>Як святкують новий рік у країні {cards[expandedCardIndex].title}</h2>
                            <p>{cards[expandedCardIndex].addFullText}</p>
                        </div>
                        <div className="related-cards">

                            {cards[expandedCardIndex].relatedCards.map((related, idx) => (
                                <div className="related-card" key={idx}>
                                    <img src={related.image} />
                                    <h3 className="related-title">{related.title}</h3>
                                    <p className="related-text">{related.text}</p>
                                </div>
                            ))}
                        </div>
                        <button onClick={handleCollapse}>Повернутися</button>
                    </div>
                </div>
            )}
        </div>
    );
};

export default MorePage;
