import "./GreetPage.scss"

const Greet = () => {
    return (
        <section className="Grates">
            <div className="containerGrate">
                <div className="Grate">
                    <h1>Як відзначають Новий рік в різних країнах світу</h1>
                </div>
                <div className="GrateText">
                    <p>Новий рік – це час магії, радості та нових починань! У кожному куточку світу це свято має свої унікальні традиції та звичаї. Ми запрошуємо вас у захопливу подорож, щоб дізнатися, як святкують Новий рік у різних країнах.
                        Тут ви знайдете цікаві факти про святкові традиції, дізнаєтеся про улюблені страви новорічного столу в різних культурах та відкриєте для себе чимало нового про головну ніч року.
                        Залишайтеся з нами, щоб разом створювати незабутню атмосферу та відкривати чарівність Нового року у світі!
                        З Новим роком! Бажаємо радості, миру та натхнення в кожному дні нового року!

                    </p>
                </div>
            </div>
        </section>
    )
}

export default Greet;